"""
网络请求 - 优雅简单的 HTTP 库
~~~~~~~~~~~~~~~~~~~~~

GET 基本使用:

   >>> 导入 网络请求
   >>> 响应 = 网络请求.查_get('https://www.grasspy.cn')
   >>> 响应.状态码
   200
   >>> '中文编程' 在 响应.内容.解码('utf-8)
   True

... 或 POST:

   >>> 数据 = 字典型(key1='value1', 键2='值2')
   >>> 响应 = 网络请求.增_post('https://httpbin.org/post', 数据=数据)
   >>> 打印(响应.文本)
   {
     ...
     "form": {
       "key1": "value1",
       "\u952e2": "\u503c2"
     },
     ...
   }

当然也支持其他 HTTP 方法.
"""
从 网络请求 导入 公用
从 网络请求.模型 导入 〇请求, 〇响应, 〇就绪请求
从 网络请求.api 导入 请求, 查_get, 头_head, 增_post, 补_patch, 改_put, 删_delete, 权_options
从 网络请求.会话 导入 〇会话
