# from functools import wraps

_请求方法字典 = {
    '查' : 'get',
    '权' : 'options',
    '头' : 'head',
    '增' : 'post',
    '改' : 'put',
    '补' : 'patch',
    '删' : 'delete',
}

_请求参数字典 = {
    '参数々' : 'params',
    '数据' : 'data',
    '头信息' : 'headers',
    '酷卡々' : 'cookies',
    '文件々' : 'files',
    '认证' : 'auth',
    '超时' : 'timeout',
    '允许重定向' : 'allow_redirects',
    '代理々' : 'proxies',
    '验证' : 'verify',
    '流' : 'stream',
    '证书' : 'cert',
    '钩子々' : 'hooks',  # sessions.py
}


# 套路 翻译请求关键词参数(函数):  # 这个装饰器用起来有问题
#     @wraps(函数)
#     套路 包装盒(*参数, **关键词参数):
#         关键词参数_英文 = {}
#         取 键, 值 于 关键词参数.项々():
#             如果 键 在 _请求参数字典:
#                 关键词参数_英文[_请求参数字典[键]] = 值
#             否则:
#                 关键词参数_英文[键] = 值
#         # 打印(参数々)
#         # 打印(关键词参数々)
#         # 打印(关键词参数_英文)
#         返回 函数(*参数, **关键词参数_英文)

#     返回 包装盒
